BaseballApp/app/helpers/generate_lineup_helper.rb

    def highest_obp?(player, lineup)
      PlayerModel.where("obp > ?", player.obp).where.not(id: lineup.map(&:player_model_id)).count == 0
---
SELECT COUNT(*) FROM "player_models" WHERE (obp > 0.9) AND 1=1

  def highest_avg?(player, lineup)
      PlayerModel.where("avg > ?", player.avg).where.not(id: lineup.map(&:player_model_id)).count == 0
---
SELECT COUNT(*) FROM "player_models" WHERE (avg > 0.9) AND 1=1

  def optimized_lineup(players)
      lineup = {}

      # Get lineup 1-4 first in order 1, 3, 2, 4
      lineup[:number_one] = PlayerModel.find { |player| highest_obp?(player, lineup) },
      lineup[:number_three] = PlayerModel.find { |player| highest_avg?(player, lineup) },
      lineup[:number_two] = PlayerModel.find { |player| highest_average_and_obp?(player, lineup) },
      lineup[:number_four] = PlayerModel.find { |player| highest_slg?(player, lineup) },

---
SELECT "player_models".* FROM "player_models"