BaseballApp/app/controllers/baseball_app_controller.rb

  def index
    puts "--------------------- In Index -------------------------"
    @allPlayers = PlayerModel.all
    puts "# of players = #{@allPlayers.size}"
---
SELECT "player_models".* FROM "player_models"
SELECT COUNT(*) FROM "player_models"

  def enterPlayer
    puts "--------------------- In Enter Bid ---------------------"
    name = params[:nameInput]
    obp = params[:obpInput]
    avg = params[:avgInput]
    slg = params[:slgInput]
    ops = params[:opsInput]
    map = {"name" => name, "obp" => obp, "avg" => avg,"slg" => slg,"ops" => ops}
    newRow = PlayerModel.new(map)
    respond_to do |format|
      if newRow.save
---
INSERT INTO "player_models" ("name", "obp", "avg", "slg", "ops", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "sdlkfj"], ["obp", 0.46], ["avg", 70.0], ["slg", 100.0], ["ops", nil], ["created_at", "2023-12-09 22:43:20.102576"], ["updated_at", "2023-12-09 22:43:20.102576"]]