BaseballApp/app/controllers/delete_app_controller.rb

SELECT "player_models".* FROM "player_models" WHERE "player_models"."name" = ? LIMIT ?  [["name", "Dirk"], ["LIMIT", 1]]
DELETE FROM "player_models" WHERE "player_models"."id" = ?  [["id", 104]]
---
  def index
    if params[:deleteInput].present?
      @deletedRows = PlayerModel.find_by(name: params[:deleteInput])
      if @deletedRows == nil
        puts "Failure"
      elsif @deletedRows.destroy