BaseballApp/app/controllers/generate_lineup_controller.rb

SELECT "player_models".* FROM "player_models"
---
  def generateBatterLineup
    @players = PlayerModel.all