BaseballApp/app/controllers/sort_by_name_controller.rb

  def sort
    @namePlayers = PlayerModel.all.sort_by{|players| [players.name]}
---
SELECT "player_models".* FROM "player_models"